app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations"
---
  def index2
    @locations = Location.all