app/controllers/locations_controller.rb

INSERT INTO "locations" ("name", "lat", "long", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Lagezo"], ["lat", 52.5264661], ["long", 13.3503549], ["created_at", "2016-05-25 16:46:06.303010"], ["updated_at", "2016-05-25 16:46:06.303010"]]
---
  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save

UPDATE "locations" SET "name" = ?, "updated_at" = ? WHERE "locations"."id" = ?  [["name", "BAMF"], ["updated_at", "2016-05-25 18:06:10.509305"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @location.update(location_params)